#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################

x,y,z = 1,2,3				# 使用序列解包方式进行赋值
print(x,y,z)

x,y = y,x					#  利用序列解包交换x和y的值
print(x,y)

# x,y,z = 1,2  			# 抛出异常
# x,y = 1,2,3  			# 抛出异常

x = y = 20					#  使用链式赋值设置x和y
print(x,y)

x *= 2					#  增量赋值
x %= 3					#  增量赋值
print(x)
