#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################

'''
{

}
if condition:
    pass
print('')
'''
name = input("请输入你的名字:")
if name == "Bill" :
    # 只有在name等于Bill时，才会执行下面两条语句
    # 这两条语句是一个整体，要么一起执行，要么都不执行
    print("这是我们的CEO")
    print("CEO正在开会，一个小时后才能见记者")
else:
   pass    # 代码块中没有任何语句时，必须用pass