#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################


print(0b110011)				# 输出二进制数
print(0o123)					# 输出八进制数
print(0xF15)					# 输出十六进制数
print(bin(12))					# 十进制转二进制，输出结果：0b1100
print(int("10110",2))			# 二进制转十进制，输出结果：22
print(int("0xF35AE",16))		# 十六进制转十进制，输出结果：996782
print(hex(54321))				# 十进制转十六进制，输出结果：0xd431
print(bin(0xF012E))			# 十六进制转二进制，输出结果：0b11110000000100101110
print(hex(0b1101101))			# 二进制转十六进制，输出结果：0x6d
print(oct(1234))				# 十进制转八进制，输出结果：0o2322
print(int("76532", 8))			# 八进制转十进制，输出结果：32090
