#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################

# coding=utf-8							当前Python源代码文件以utf-8编码格式保存

"""									多行注释（用双引号括起来）
作者：李宁
地点：earth

"""

# 用于计算2的4次幂						单行注释
print(2 ** 4)  # 单行注释

'''									多行注释（用单引号括起来）
这段代码用于计算一个表达式的值
(1 + 2) * 20
'''
print((1 + 2) * 20)
