#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################

print(2 + 4)						#  运算结果：6
print(126 - 654)					#  运算结果：-528
print(6 + 20 * 4)					#  运算结果：86
print((20 + 54) * 30)				#  运算结果：2220
print(1/2)							#  运算结果：0.5
print(1//2)						#  运算结果：0
print(3/2)							#  运算结果：1.5
print(3//2)						#  运算结果：1
print(4**3)						#  运算结果：64
print(3 + 5 * -3 ** 4 - (-5)**2)	#  运算结果：-427
#  用变量操作数值
x = 30
y = 50
k = 10.2
print(x + y * k)					#  运算结果：540.0
