#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################

# 12345
print(bin(12345))           # 10进制转2进制
print(oct(12345))           # 10进制转8进制
print(hex(12345))           # 10进制转16进制

# 0xF98A
print(bin(0xF98A))          # 16进制转2进账
print(oct(0xF98A))          # 16进制转8进制
print(int('F98A', 16))      # 16进制换10进制


# 0b1100010110
print(oct(0b1100010110))    # 2进制转8进制
print(int('1100010110', 2)) # 2进账转10进制
print(hex(0b1100010110))    # 2进制转16进制

