#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################

print([1,2,3] + [6,7,8])	# 运行结果：[1,2,3,6,7,8]
print("Hello" + " world") 	# 运行结果：Hello world
print([1,2,3] + ["hello"])	# 把字符串作为序列的一个元素，运行结果：[1,2,3,"hello"]
# 运行结果：[1,2,3，'h', 'e', 'l', 'l', 'o']
print([1,2,3] + ['h', 'e', 'l', 'l', 'o'])
print([1,2,3] + "hello")  	# 抛出异常，序列不能和字符串直接相加
