#########################################################################
# 作者:李宁（蒙娜丽宁），UnityMarvel创始人
#
# 微信公众号：极客起源
#
# B站：https://space.bilibili.com/477001733
#
# Copyright © 2022 Lining. All rights reserved.
#
# 版本: 2.0
#########################################################################

s = ["Bill", "Mike", "John"]
s[-1] = "Mary"						#  修改列表最后一个元素值
print(s)                                  #  运行结果：['Bill', 'Mike', 'Mary']
s[2] = "Peter"					     #  索引3超出了列表s的索引范围（-3到2），会抛出异常
s[-3] = "蜘蛛侠"				     #  索引-3是列表s的第1个元素，相当于s[0]
print(s)							#  运行结果：['蜘蛛侠', 'Mike', 'Mary']
s[-4] = "钢铁侠"				     #  索引-4超出了列表s的索引范围（-3到2），会抛出异常
